import React, { useContext } from "react";
import { Context } from "../../main";

const About = () => {
  const { mode } = useContext(Context);
  return (
    <article className={ mode === "dark" ? "dark-bg about" : "light-bg about" }>
      <div className="container">
        <h2>Про нас</h2>
        <p>
          Ласкаво просимо до онлайн бібліотеки, де зустрічаються талановиті автори та пристрасні читачі! Наша бібліотека - це віртуальний світ, де слова стають живими, а історії оживають під чутливими очима читачів.
        </p>
        <p>
          У нас ви знайдете твори різних авторів, які відображають різноманітні жанри та теми. Від класичних творів до сучасних бестселерів, ми пропонуємо широкий вибір книг для всіх смаків і вікових категорій.
        </p>
        <p>
          Наші автори - це справжні майстри слова, які вміють створювати захопливі сюжети, захоплюючі персонажі та емоційні відображення життя. Вони дарують свої твори світові, надихаючи та розширюючи горизонти наших читачів.
        </p>
        <p>
          А читачі - це серце нашої спільноти. Вони відкриваються нашим авторам, переживають разом з героями і знаходять в кожній книзі нові історії для себе. Їхнє бажання вчитися, ділитися враженнями та досліджувати світ слів зробило нашу бібліотеку справжнім домом для книголюбів.
        </p>
        <p>
          Так що приєднуйтеся до нашої онлайн бібліотеки, де автори творять, а читачі знаходять вічне натхнення і задоволення в кожній оберненій сторінці.
        </p>
      </div>
    </article>
  );
};

export default About;
